import numpy as np
import pandas as pd
import pytest


# Список танзакций
@pytest.fixture
def transaction_df():
    return pd.DataFrame(
        {
            "Дата операции": [
                "11.05.2021 11:01:38",
                "16.05.2021 10:29:04",
                "16.05.2021 16:02:01",
                "26.05.2021 10:11:11",
                "05.09.2020 14:29:16",
                "04.09.2020 15:32:06",
                "04.09.2020 15:31:40",
                "03.09.2020 16:05:11",
                "03.09.2020 10:05:11",
                "02.09.2020 08:50:11",
                "01.09.2020 19:43:56",
            ],
            "Дата платежа": [
                "16.05.2021",
                "16.05.2021",
                "11.05.2021",
                "26.05.2021",
                "07.09.2020",
                "06.09.2020",
                "06.09.2020",
                "06.09.2020",
                "06.09.2020",
                "04.09.2020",
                "01.09.2020",
            ],
            "Номер карты": [
                np.nan,
                np.nan,
                np.nan,
                "*7197",
                "*7197",
                "*7197",
                "*7197",
                "*7197",
                "*7197",
                "*7197",
                "*8888",
            ],
            "Статус": ["OK", "OK", "OK", "FAILED", "OK", "OK", "OK", "OK", "OK", "OK", "OK"],
            "Сумма операции": [-400.0, -50.0, -105.0, -90.0, -68.0, -95.0, 3000.0, -510.0, -1032.00, -795.0, -2024],
            "Валюта операции": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Сумма платежа": [-400.0, -50.0, -105.0, -90.0, -68.0, -95.0, 3000.0, -510.0, -1032.00, -795.0, -2024],
            "Валюта платежа": ["RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB", "RUB"],
            "Кэшбэк": [np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, np.nan, 20.0, 15.0, np.nan, np.nan],
            "Категория": [
                "Переводы",
                "Переводы",
                "Переводы",
                np.nan,
                "Супермаркеты",
                "Супермаркеты",
                "Пополнения",
                "Транспорт",
                "Фастфуд",
                "Перевод мошенникам на связь",
                "Покупка AAPL",
            ],
            "MCC": [np.nan, np.nan, np.nan, np.nan, 5411.0, 5411.0, np.nan, 4111, 5814, 6669, 9966],
            "Описание": [
                "Людмила Щ.",
                "Игорь С.",
                "Ольга И.",
                "Снятие наличных в банкомате",
                "Superpupermarket 1",
                "Семерочка",
                "Перевод с карты",
                "ООО Римская конница",
                "ЗАО Древнерусская шаурма",
                "IP-телефония",
                "Покупка через брокера в Telegram",
            ],
            "Округление на инвесткопилку": [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
            "Сумма операции с округлением": [400.0, 50.0, 105.0, 90.0, 68, 95, 3000, 510, 1032, 795, 2024],
        }
    )


@pytest.fixture
def transaction_df_zero():
    return pd.DataFrame(
        {
            "Дата операции": [],
            "Дата платежа": [],
            "Номер карты": [],
            "Статус": [],
            "Сумма операции": [],
            "Валюта операции": [],
            "Сумма платежа": [],
            "Валюта платежа": [],
            "Кэшбэк": [],
            "Категория": [],
            "MCC": [],
            "Описание": [],
            "Округление на инвесткопилку": [],
            "Сумма операции с округлением": [],
        }
    )
