import src.services as services


# Тестирование функции поиска переводов физическим лицам get_transfer_to_individual
def test_get_transfer_to_individual(transaction_df):
    # Преобразует заготовленный шаблон из DataFrame в list[dict]. Шаблон в conftest.py
    transactions_list = transaction_df.to_dict(orient="records")
    confirm = (
        '[{"Дата операции": "11.05.2021 11:01:38", "Дата платежа": "16.05.2021", "Номер карты": NaN, '
        '"Статус": "OK", "Сумма операции": -400.0, "Валюта операции": "RUB", "Сумма платежа": -400.0, '
        '"Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Переводы", "MCC": NaN, "Описание": "Людмила Щ.", '
        '"Округление на инвесткопилку": 0.0, "Сумма операции с округлением": 400.0}, '
        '{"Дата операции": "16.05.2021 10:29:04", "Дата платежа": "16.05.2021", "Номер карты": NaN, '
        '"Статус": "OK", "Сумма операции": -50.0, "Валюта операции": "RUB", "Сумма платежа": -50.0, '
        '"Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Переводы", "MCC": NaN, "Описание": "Игорь С.", '
        '"Округление на инвесткопилку": 0.0, "Сумма операции с округлением": 50.0}, '
        '{"Дата операции": "16.05.2021 16:02:01", "Дата платежа": "11.05.2021", "Номер карты": NaN, '
        '"Статус": "OK", "Сумма операции": -105.0, "Валюта операции": "RUB", "Сумма платежа": -105.0, '
        '"Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Переводы", "MCC": NaN, "Описание": "Ольга И.", '
        '"Округление на инвесткопилку": 0.0, "Сумма операции с округлением": 105.0}]'
    )
    assert (services.get_transfer_to_individual(transactions_list)) == confirm


# Тестирование функции поиска переводов физическим лицам get_transfer_to_individual - вход - пустой датафрейм
def test_get_transfer_to_individual_no_data(transaction_df_zero):
    # Преобразует заготовленный шаблон из DataFrame в list[dict]. Шаблон в conftest.py
    transactions_list = transaction_df_zero.to_dict(orient="records")
    confirm = "[]"
    assert (services.get_transfer_to_individual(transactions_list)) == confirm
